## Pandas Part 3 Exercises

In [3]:
#Run this to import libraries and add inline matplotlib magic
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

In [4]:
#Given the items and the labels variables, 
#make a pandas series with the labels, as the index, mapped to the items
items = [2, 4, 6, 10, 9]
labels = ["Oranges", "Apples", "Grapes", "Bannanas", "Mangos"]

In [9]:
#Using numpy, generate an array with a numbers within the range of 0 and 10
#not inclusive meaning 0 and 10 are not included within the array.

[ 1  2  3  4  5  6  7  8  9 10]

In [6]:
#Now using that array, reshape it to be three rows of arrays with a length of three
# [1, 2, 3]
# [4, 5, 6]
# [7, 8, 9]

In [10]:
#Using pandas, print out all of the values that do exist within this pandas series
#where keys are the name of the product and values are the # of times purchased

sales_raw = {
    'Chocolate': 100, 'Pineapples': 22, 'Cheese': 24, 'Bread': None, \
          'Watermelon': 1242, 'Juice': None}
sales_data_series = pd.Series(sales_raw, name='Purchases')

In [17]:
#Read in CSV of movie data
movies = pd.read_csv('data/imdb_movie/movie_metadata.csv')

In [15]:
#Given the movies variable in the previous cell, use .groupby and counts to group
#the # of movies within a certain country within a pandas Dataframe
# *Bonus* Don't include movies without a country to your grouping (AKA values of NaN)
movies_country = movies[['country']]
movies_country.head(8)

  country
0     USA
1     USA
2      UK
3     USA
4     NaN
5     USA
6     USA
7     USA

In [30]:
#Now create a DataFrame using a boolean filter that eliminates any movie that was made
#in the USA and is less than 100 minutes long
filter_1 = #Write code here
filtered_df = movies[filter_1]
filtered_df[['movie_title', 'country', 'duration']].head(8)

SyntaxError: invalid syntax (2117051012.py, line 3)

In [32]:
#Notice that there are some missing values for duration, replace those
#missing values with the mean of all of the values for duration within the 
#DataFrame
movies['duration'].isnull().sum()

15

In [33]:
#Now create a new column called length which is either labeled
#as "short", "medium", or "long" depending on the movie's duration
# short :   duration <= 45 | medium : 45 < duration <= 90 | long : duration > 90

color                         19
director_name                104
num_critic_for_reviews        50
duration                      15
director_facebook_likes      104
actor_3_facebook_likes        23
actor_2_name                  13
actor_1_facebook_likes         7
gross                        884
genres                         0
actor_1_name                   7
movie_title                    0
num_voted_users                0
cast_total_facebook_likes      0
actor_3_name                  23
facenumber_in_poster          13
plot_keywords                153
movie_imdb_link                0
num_user_for_reviews          21
language                      14
country                        5
content_rating               303
budget                       492
title_year                   108
actor_2_facebook_likes        13
imdb_score                     0
aspect_ratio                 329
movie_facebook_likes           0
dtype: int64

In [ ]:
#Now create a new column called length which is either labeled
#as "short", "medium", or "long" depending on the movie's duration
# short :   duration <= 45 | medium : 45 < duration <= 90 | long : duration > 90

color                         19
director_name                104
num_critic_for_reviews        50
duration                      15
director_facebook_likes      104
actor_3_facebook_likes        23
actor_2_name                  13
actor_1_facebook_likes         7
gross                        884
genres                         0
actor_1_name                   7
movie_title                    0
num_voted_users                0
cast_total_facebook_likes      0
actor_3_name                  23
facenumber_in_poster          13
plot_keywords                153
movie_imdb_link                0
num_user_for_reviews          21
language                      14
country                        5
content_rating               303
budget                       492
title_year                   108
actor_2_facebook_likes        13
imdb_score                     0
aspect_ratio                 329
movie_facebook_likes           0
dtype: int64

In [35]:
#Run this cell so you can complete the next cell
company = pd.read_csv('company.csv')
company = company.set_index('Name')
company

      sales_budget  marketing_budget  Income
Name
PLP            123                90     400
MX             340                85     700
YP              45                55     210
UP              27                60     200
QT              80               100     225
AD              95               100     300
XC              26                40     150
MA              72                90     220
GP              66                80     290
LA              54                70     240
WT              43                50     150

In [ ]:
#Given the company DataFrame, make a scatter plot plotting income to marketing_budget